mynameisted/6dofRoboArm-msp432/ArmController/main_tirtos.c
/*
 * Copyright (c) 2016-2019, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,

 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== main_tirtos.c ========
 */
#include <stdint.h>

/* POSIX Header files */
#include <pthread.h>

/* RTOS header files */
#include <ti/sysbios/BIOS.h>

/* Driver configuration */
#include <ti/drivers/Board.h>

#include "msp432_bluetooth.h"

#include "msp432_mpu6050.h"

#include "msp432_sensors.h"

#include "MSP432_MG995.h"

#include "LED.h"

/* Stack size in bytes */
#define THREADSTACKSIZE    2048

/*
 *  ======== main ========
 */
int main(void)
    {
    pthread_t           thread;
    pthread_attr_t      attrs;
    struct sched_param  priParam;
    int                 retc;

    /* Call driver init functions */
    Board_init();

    /* Initialize the attributes structure with default values */
    pthread_attr_init(&attrs);

    /* Set priority, detach state, and stack size attributes */
    priParam.sched_priority = 1;
    retc = pthread_attr_setschedparam(&attrs, &priParam);
    retc |= pthread_attr_setdetachstate(&attrs, PTHREAD_CREATE_DETACHED);
    retc |= pthread_attr_setstacksize(&attrs, THREADSTACKSIZE);
    if (retc != 0) {
        /* failed to set attributes */
        while (1) {}
    }

    /*
    //Bluetooth Thread
    priParam.sched_priority = 1;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&bluetoothThreadHandler, &attrs, bluetoothThread, NULL);
    if (retc != 0) {
        while (1) {}
    }

    priParam.sched_priority = 2;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&servoThreadHandler, &attrs, servoThread, NULL);
    if (retc != 0) {

        while (1) {}
    }

    //PressureSensor Thread
    priParam.sched_priority = 2;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&pressureSensorThreadHandler, &attrs, pressureSensorThread, NULL);
    if (retc != 0) {

        while (1) {}
    }
*/

    //Bluetooth Thread
    priParam.sched_priority = 1;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&bluetoothThreadHandler, &attrs, bluetoothThread, NULL);
    if (retc != 0) {
        while (1) {}
    }

    //MPU6050 Thread
    priParam.sched_priority = 2;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&mpu6050ThreadHandler, &attrs, mpu6050Thread, NULL);
    if (retc != 0) {

        while (1) {}
    }

    //FlexSensor Thread
    priParam.sched_priority = 2;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&flexSensorThreadHandler, &attrs, flexSensorThread, NULL);
    if (retc != 0) {

        while (1) {}
    }

    priParam.sched_priority = 1;
    pthread_attr_setschedparam(&attrs, &priParam);
    retc = pthread_create(&ledThreadHandler, &attrs, ledThread, NULL);
    if (retc != 0) {

        while (1) {}
    }





    BIOS_start();

    return (0);
}
